services/thread_api/app/controllers/tweets_chosen_threads_controller.rb

  def thread_response
    root = TweetsChosenThread.find(:first, :conditions => {:thread_id => params[:id]}, :order => "pubdate asc")
    tweet = Tweet.find_by_twitter_id(root.twitter_id)
---
SELECT * FROM `tweets_chosen_threads` WHERE (`tweets_chosen_threads`.`thread_id` = '4595') ORDER BY pubdate asc LIMIT 1
SELECT * FROM `tweets` WHERE (`tweets`.`twitter_id` = 30368790613069824) LIMIT 1